касса_Вегас/src/Documents/Чек/Чек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Чек</name>
  <basedOn>Document.Чек</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <attributes>
    <name>АдресEmailПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЧекаЕГАИС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>0 - продажа, 1 - возврат</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКоррекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеприменениеККТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПредписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКоррекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьЧекаЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАдресаМестоположения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакСпособаРасчета</name>
    <type>
      <types>EnumRef.ПризнакиСпособаРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложенияККТ</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусыОплатыЧека</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЧека</name>
    <type>
      <types>EnumRef.СтатусыЧеков</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКоррекции</name>
    <type>
      <types>EnumRef.ТипыКоррекции</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтчетОРозничныхПродажах</name>
    <type>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйПризнак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекОснование</name>
    <type>
      <types>DocumentRef.Чек</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекПродажи</name>
    <type>
      <types>DocumentRef.Чек</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЧекКоррекции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьВводаАкцизнойМарки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьШтрихкодаПриПродаже</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСУчетомСкидки</name>
      <comment>Заполняется только при возврате товаров. Идентифицирует позицию чека продажи.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>68</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипМаркировки</name>
      <type>
        <types>EnumRef.ТипыМаркировкиККТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлобальныйИдентификаторТорговойЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлатежнойСистемы</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПлатежнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСсылкиОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлипЧек</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

касса_Вегас/src/Documents/Чек/Forms/ПрочиеДанные/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Чек = Параметры.Чек;
	
	ЗаполнитьДанные(Чек);
	
	НастроитьВидимостьПолей();
	
	НастроитьФормуПоЗначениямНастроек();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанные(Чек)
	
	РеквизитыЧека = ОбщегоНазначенияВызовСервера.ЗначенияРеквизитовОбъекта(Чек, 
		"ФискальныйНомер,
		|ШтрихкодЧека,
		|ПризнакСпособаРасчета,
		|Дата,
		|АдресЧекаЕГАИС,
		|ПодписьЧекаЕГАИС,
		|ФискальныйПризнак,
		|СистемаНалогообложенияККТ,
		|КассоваяСмена"
	);
	
	
	Если ЗначениеЗаполнено(РеквизитыЧека.СистемаНалогообложенияККТ) Тогда
		
		СНО = ПолучитьПредставлениеСНО(РеквизитыЧека.СистемаНалогообложенияККТ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыЧека.КассоваяСмена) Тогда
		
		НомерСмены = ПродажиВызовСервера.ПолучитьНомерСменыДляПечати(РеквизитыЧека.КассоваяСмена, Ложь);
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЧека,
		"ФискальныйНомер,
		|ШтрихкодЧека,
		|ПризнакСпособаРасчета,
		|Дата,
		|АдресЧекаЕГАИС,
		|ПодписьЧекаЕГАИС,
		|ФискальныйПризнак
		|"
	);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеСНО(СистемаНалогообложенияККТ)
	
	ПредставлениеСНО = "";
	
	Если СистемаНалогообложенияККТ = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход Тогда
		
		ПредставлениеСНО = НСтр("ru = 'УСН доход'");
		
	ИначеЕсли СистемаНалогообложенияККТ = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
		
		ПредставлениеСНО = НСтр("ru = 'УСН доход-расход'");
		
	ИначеЕсли СистемаНалогообложенияККТ = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД Тогда
		
		ПредставлениеСНО = НСтр("ru = 'ЕНВД'");
		
	ИначеЕсли СистемаНалогообложенияККТ = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН Тогда
		
		ПредставлениеСНО = НСтр("ru = 'ЕСН'");
		
	ИначеЕсли СистемаНалогообложенияККТ = Перечисления.ТипыСистемНалогообложенияККТ.Патент Тогда
		
		ПредставлениеСНО = НСтр("ru = 'Патент'");
	Иначе
		
		ПредставлениеСНО = НСтр("ru = 'ОСН'");
	КонецЕсли;
	
	Возврат ПредставлениеСНО;
	
КонецФункции

&НаСервере
Процедура НастроитьВидимостьПолей()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
		"СНО",
		"Видимость",
		ЗначениеЗаполнено(СНО)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
		"НомерСмены",
		"Видимость",
		ЗначениеЗаполнено(НомерСмены)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
		"ФискальныйНомер",
		"Видимость",
		ЗначениеЗаполнено(ФискальныйНомер)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
		"ФискальныйПризнак",
		"Видимость",
		ЗначениеЗаполнено(ФискальныйПризнак)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
		"ШтрихкодЧека",
		"Видимость",
		ЗначениеЗаполнено(ШтрихкодЧека)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
		"АдресЧекаЕГАИС",
		"Видимость",
		ЗначениеЗаполнено(АдресЧекаЕГАИС)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
		"ПодписьЧекаЕГАИС",
		"Видимость",
		ЗначениеЗаполнено(ПодписьЧекаЕГАИС)
	);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
